# Задача 1 Задайте список из нескольких чисел. 
# Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# *Пример:*
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

# def sum(n):
#     if n%2 != 0 :
#         n+=n
  

list = [2,3,5,9,3]
for i in enumerate(2):
        print(i)